-- ----------------------------
-- Records of mp_drug
-- ----------------------------
INSERT INTO `mp_drug` (`id`, `name`, `produced_date`, `expire_date`,
                       `description`, `indication`, `contraindication`, `user_id`, `group_id`)
VALUES (2, '测试奥硝唑片postman', '2020-02-12', '2020-02-19', 'hello',
        '{\"content\":\"1.治疗原虫感染-毛滴虫感染（泌尿生殖感染）阿米巴原虫感染（肠、肝阿米巴虫病、阿米巴痢疾、阿米巴脓肿），贾第鞭毛虫病；2.治疗厌氧菌感染（如败血症脑膜炎、腹膜炎、手术后伤口感染、产后脓毒病、脓毒性流产、子宫内膜炎以及敏感菌引起的其它感染），预防各种手术后厌氧菌感染\"}',
        '{\"content\":\"对硝基咪唑类药物过敏的患者对此药也过敏，禁用于对此药过敏的患者；也禁用于脑和脊髓发生病原菌变的患者，羊癫疯及各种器官硬化症患者。\"}', 12, 0),
       (100, '奥硝唑片postman2', '2020-02-12', '2020-02-19', 'hello',
        '{\"content\":\"1.治疗原虫感染-毛滴虫感染（泌尿生殖感染）阿米巴原虫感染（肠、肝阿米巴虫病、阿米巴痢疾、阿米巴脓肿），贾第鞭毛虫病；2.治疗厌氧菌感染（如败血症脑膜炎、腹膜炎、手术后伤口感染、产后脓毒病、脓毒性流产、子宫内膜炎以及敏感菌引起的其它感染），预防各种手术后厌氧菌感染。\"}',
        '{\"content\":\"对硝基咪唑类药物过敏的患者对此药也过敏，禁用于对此药过敏的患者；也禁用于脑和脊髓发生病原菌变的患者，羊癫疯及各种器官硬化症患者。\"}', 14, 2),
       (119, '奥硝唑片', '2019-02-18', '2020-09-01', NULL,
        '{\"content\":\"1.治疗原虫感染-毛滴虫感染（泌尿生殖感染）阿米巴原虫感染（肠、肝阿米巴虫病、阿米巴痢疾、阿米巴脓肿），贾第鞭毛虫病；2.治疗厌氧菌感染（如败血症脑膜炎、腹膜炎、手术后伤口感染、产后脓毒病、脓毒性流产、子宫内膜炎以及敏感菌引起的其它感染），预防各种手术后厌氧菌感染。nkk\"}',
        '{\"content\":\"对硝基咪唑类药物过敏的患者对此药也过敏，禁用于对此药过敏的患者；也禁用于脑和脊髓发生病原菌变的患者，羊癫疯及各种器官硬化症患者。npp\"}', 14, 1),
       (100000007, '奥硝唑片', '2020-02-21', '2020-02-21', NULL,
        '{\"content\":\"1.治疗原虫感染-毛滴虫感染（泌尿生殖感染）阿米巴原虫感染（肠、肝阿米巴虫病、阿米巴痢疾、阿米巴脓肿），贾第鞭毛虫病；2.治疗厌氧菌感染（如败血症脑膜炎、腹膜炎、手术后伤口感染、产后脓毒病、脓毒性流产、子宫内膜炎以及敏感菌引起的其它感染），预防各种手术后厌氧菌感染。\"}',
        '{\"content\":\"对硝基咪唑类药物过敏的患者对此药也过敏，禁用于对此药过敏的患者；也禁用于脑和脊髓发生病原菌变的患者，羊癫疯及各种器官硬化症患者。\"}', 13, 1),
       (100000008, '奥硝唑片postman2', '2020-02-12', '2020-02-19', 'hello',
        '{\"content\":\"1.治疗原虫感染-毛滴虫感染（泌尿生殖感染）阿米巴原虫感染（肠、肝阿米巴虫病、阿米巴痢疾、阿米巴脓肿），贾第鞭毛虫病；2.治疗厌氧菌感染（如败血症脑膜炎、腹膜炎、手术后伤口感染、产后脓毒病、脓毒性流产、子宫内膜炎以及敏感菌引起的其它感染），预防各种手术后厌氧菌感染。\"}',
        '{\"content\":\"对硝基咪唑类药物过敏的患者对此药也过敏，禁用于对此药过敏的患者；也禁用于脑和脊髓发生病原菌变的患者，羊癫疯及各种器官硬化症患者。\"}', 12, 2);

-- ----------------------------
-- Records of mp_drug_tag
-- ----------------------------
INSERT INTO `mp_drug_tag` (`drug_id`, `tag_id`)
VALUES (100, 1000),
       (119, 1001),
       (100000001, 101),
       (100000004, 134),
       (100000005, 134);

-- ----------------------------
-- Records of mp_group
-- ----------------------------
INSERT INTO `mp_group` (`id`, `name`, `create_at`, `create_by`)
VALUES (1, '测试群组1', '2020-02-21 19:02:14', 12),
       (2, '测试群组2', '2020-02-21 19:10:30', 12);

-- ----------------------------
-- Records of mp_tag
-- ----------------------------
INSERT INTO `mp_tag` (`id`, `name`, `user_id`)
VALUES (101, '头疼', 10086),
       (102, '咳嗽', 10086),
       (130, '嘿嘿', 10086),
       (131, '干咳', 13),
       (133, 'biao\'qian\'biao\'qian', 12),
       (1000, 'shenmiu_delete_drugs', 14),
       (1001, 'shenmiu_delete_drugs', 14);

-- ----------------------------
-- Records of mp_user
-- ----------------------------
INSERT INTO `mp_user` (`id`, `open_id`, `created_at`)
VALUES (10, 'o9ik85BGo8Jo3AdtNwQDNGSfaiEs', '2020-02-17 21:53:56'),
       (11, 'open_id_for_test', '2020-02-18 13:37:05'),
       (12, 'o9ik85FW6IYCSR1mXObaTdcb3yCU', '2020-02-18 13:54:29'),
       (13, 'o9ik85JgSyp1QrKXeoBkC6bD2B-w', '2020-02-18 16:36:24'),
-- shenmiu's account corresponding AlgNG1FZKwQsEEk2KCgBAlEcOSI7DwwKMigAH004LyUAWhpcEFApXl9fAC8OJFsdKVowWU0
       (14, 'o9ik85GiMt9_DDlc5lPNWbmnBAls', '2020-02-19 16:50:28'),
       (15, 'o9ik85NofPWxz6jtZIIJBoqZBXhA', '2020-02-19 23:03:24'),
       (16, 'o9ik85Lc_uXD_xu7UOgqyG4wr9BI', '2020-02-19 23:03:24'),
       (17, 'o9ik85HcJ5nHL3T7jOge6OFK0K_c', '2020-02-21 09:35:59'),
       (18, 'o9ik85BQOgSxTz7T_PDkLLTxrYtk', '2020-02-21 09:49:48'),
       (19, 'o9ik85AnQiZh8WbCQkfeqTaRt1K4', '2020-02-21 09:49:48');

-- ----------------------------
-- Records of mp_warehouse
-- ----------------------------
INSERT INTO `mp_warehouse` (`id`, `name`, `manufacture`, `indication`, `contraindication`)
VALUES (1, '奥硝唑片', '潇然',
        '{\"content\":\"1.治疗原虫感染-毛滴虫感染（泌尿生殖感染）阿米巴原虫感染（肠、肝阿米巴虫病、阿米巴痢疾、阿米巴脓肿），贾第鞭毛虫病；2.治疗厌氧菌感染（如败血症脑膜炎、腹膜炎、手术后伤口感染、产后脓毒病、脓毒性流产、子宫内膜炎以及敏感菌引起的其它感染），预防各种手术后厌氧菌感染。\"}',
        '{\"content\":\"对硝基咪唑类药物过敏的患者对此药也过敏，禁用于对此药过敏的患者；也禁用于脑和脊髓发生病原菌变的患者，羊癫疯及各种器官硬化症患者。\"}'),
       (2, '奥2', '潇然', '{\"content\":\"i2\"}', '{\"content\":\"c2\"}'),
       (3, '奥3', '潇然3', '{\"content\":\"i3\"}', '{\"content\":\"c3\"}'),
       (4, 'charles奥4', '小小然', '{\"content\":\"i4\"}', '{\"content\":\"c4\"}'),
       (5, '奥5', '潇然5', '{\"content\":\"i5\"}', '{\"content\":\"c5\"}'),
       (6, 'Shenmiu奥6', '潇然6', '{\"content\":\"i6\"}', '{\"content\":\"c6\"}'),
       (7, 'MrGao奥7', '潇7', '{\"content\":\"i7\"}', '{\"content\":\"c7\"}'),
       (8, 'aneureka奥8', '潇然8', '{\"content\":\"i8\"}', '{\"content\":\"c8\"}'),
       (9, 'chris奥9', '嘻嘻', '{\"content\":\"i9\"}', '{\"content\":\"c9\"}'),
       (10, 'arthur奥10', '哈哈', '{\"content\":\"i10\"}', '{\"content\":\"c10\"}'),
       (11, 'limittest奥', '特棒', '{\"content\":\"i11\"}', '{\"content\":\"c11\"}');