-- ----------------------------
-- Records of mp_drug
-- ----------------------------
INSERT INTO `mp_drug` (`id`, `name`, `produced_date`, `expire_date`, `description`, `reminders`,
                       `indication`, `contraindication`, `user_id`, `group_id`)
VALUES (2, '测试奥硝唑片postman', '2020-02-12', '2020-02-19', 'hello', NULL,
        '{\"content\":\"1.治疗原虫感染-毛滴虫感染（泌尿生殖感染）阿米巴原虫感染（肠、肝阿米巴虫病、阿米巴痢疾、阿米巴脓肿），贾第鞭毛虫病；2.治疗厌氧菌感染（如败血症脑膜炎、腹膜炎、手术后伤口感染、产后脓毒病、脓毒性流产、子宫内膜炎以及敏感菌引起的其它感染），预防各种手术后厌氧菌感染\"}',
        '{\"content\":\"对硝基咪唑类药物过敏的患者对此药也过敏，禁用于对此药过敏的患者；也禁用于脑和脊髓发生病原菌变的患者，羊癫疯及各种器官硬化症患者。\"}', 12, 0),
       (100, '奥硝唑片postman2', '2020-02-12', '2020-02-19', 'hello', NULL,
        '{\"content\":\"1.治疗原虫感染-毛滴虫感染（泌尿生殖感染）阿米巴原虫感染（肠、肝阿米巴虫病、阿米巴痢疾、阿米巴脓肿），贾第鞭毛虫病；2.治疗厌氧菌感染（如败血症脑膜炎、腹膜炎、手术后伤口感染、产后脓毒病、脓毒性流产、子宫内膜炎以及敏感菌引起的其它感染），预防各种手术后厌氧菌感染。\"}',
        '{\"content\":\"对硝基咪唑类药物过敏的患者对此药也过敏，禁用于对此药过敏的患者；也禁用于脑和脊髓发生病原菌变的患者，羊癫疯及各种器官硬化症患者。\"}', 14, 2),
       (119, '奥硝唑片', '2019-02-18', '2020-09-01', NULL, NULL,
        '{\"content\":\"1.治疗原虫感染-毛滴虫感染（泌尿生殖感染）阿米巴原虫感染（肠、肝阿米巴虫病、阿米巴痢疾、阿米巴脓肿），贾第鞭毛虫病；2.治疗厌氧菌感染（如败血症脑膜炎、腹膜炎、手术后伤口感染、产后脓毒病、脓毒性流产、子宫内膜炎以及敏感菌引起的其它感染），预防各种手术后厌氧菌感染。nkk\"}',
        '{\"content\":\"对硝基咪唑类药物过敏的患者对此药也过敏，禁用于对此药过敏的患者；也禁用于脑和脊髓发生病原菌变的患者，羊癫疯及各种器官硬化症患者。npp\"}', 12, 1);

-- ----------------------------
-- Records of mp_drug_tag
-- ----------------------------
INSERT INTO `mp_drug_tag` (`drug_id`, `tag_id`)
VALUES (100, 1000);

-- ----------------------------
-- Records of mp_group
-- ----------------------------
INSERT INTO `mp_group` (`id`, `name`, `create_at`, `create_by`)
VALUES (1, '测试群组1', '2020-02-21 19:02:14', 12),
       (2, '测试群组2', '2020-02-21 19:10:30', 12);

-- ----------------------------
-- Records of mp_tag
-- ----------------------------
INSERT INTO `mp_tag` (`id`, `name`, `user_id`)
VALUES (101, '头疼', 10086),
       (1000, 'shenmiu_delete_drugs', 14),
       (1001, 'shenmiu_delete_drugs', 14);

-- ----------------------------
-- Records of mp_user
-- ----------------------------
INSERT INTO `mp_user` (`id`, `open_id`, `created_at`)
VALUES (12, 'o9ik85FW6IYCSR1mXObaTdcb3yCU', '2020-02-18 13:54:29'),
       (14, 'o9ik85GiMt9_DDlc5lPNWbmnBAls', '2020-02-19 16:50:28');

-- ----------------------------
-- Records of mp_user_group
-- ----------------------------
BEGIN;
INSERT INTO `mp_user_group`
VALUES (12, 1);
INSERT INTO `mp_user_group`
VALUES (12, 2);
COMMIT;

-- ----------------------------
-- Records of mp_warehouse
-- ----------------------------
INSERT INTO `mp_warehouse` (`id`, `name`, `manufacture`, `indication`, `contraindication`)
VALUES (1, '奥硝唑片', '潇然',
        '{\"content\":\"1.治疗原虫感染-毛滴虫感染（泌尿生殖感染）阿米巴原虫感染（肠、肝阿米巴虫病、阿米巴痢疾、阿米巴脓肿），贾第鞭毛虫病；2.治疗厌氧菌感染（如败血症脑膜炎、腹膜炎、手术后伤口感染、产后脓毒病、脓毒性流产、子宫内膜炎以及敏感菌引起的其它感染），预防各种手术后厌氧菌感染。\"}',
        '{\"content\":\"对硝基咪唑类药物过敏的患者对此药也过敏，禁用于对此药过敏的患者；也禁用于脑和脊髓发生病原菌变的患者，羊癫疯及各种器官硬化症患者。\"}'),
       (2, '奥2', '潇然', '{\"content\":\"i2\"}', '{\"content\":\"c2\"}');